README.html
<!doctype html>
<html lang="fr">
<head>
<title>Séquençage WS et SW</title>
<!-- 2016-04-07 Thu 13:18 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Samuel Barreto">

<link href="https://maxcdn.bootstrapcdn.com/bootswatch/3.3.6/paper/bootstrap.min.css" rel="stylesheet" integrity="sha384-2mX2PSpkRSXLQzmNzH3gwK6srb06+OfbDlYjbog8LQuALYJjuQ3+Yzy2JIWNV9rW" crossorigin="anonymous">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Séquençage WS et SW</h1>
<p>
Ce dossier contient les séquences des plaques obtenues avec les
constructions SW et WS, envoyées à séquencer le <span class="timestamp-wrapper"><span class="timestamp">[2016-03-15 Tue]</span></span>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Dossiers et fichiers</h2>
<div class="outline-text-2" id="text-1">
<p>
Les données brutes au format .zip sont dans le dossier <code>raw</code>. Elles
sont extraites dans le dossier <code>data</code>, séparé en <code>ws</code> et <code>sw</code> pour les
analyses. Rien ne doit toucher au dossier <code>raw</code>.
</p>

<p>
J'ai ensuite utilisé le script <a href="./src/sort_into_dir.sh">./src/sort_into_dir.sh</a> pour classer les
fichiers selon leur extension.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #586e75;">#</span><span style="color: #586e75;">!/bin/</span><span style="color: #859900; font-weight: bold;">bash</span>

<span style="color: #839496; font-weight: bold;">cd</span> data/ws

mkdir fasta spectro seq

find . -name <span style="color: #2aa198;">"*.fas"</span>  -maxdepth <span style="color: #6c71c4;">1</span> -exec mv <span style="color: #2aa198;">{}</span> ./fasta/ <span style="color: #2aa198;">\;</span>
find . -name <span style="color: #2aa198;">"*.ab1"</span>  -maxdepth <span style="color: #6c71c4;">1</span> -exec mv <span style="color: #2aa198;">{}</span> ./spectro/ <span style="color: #2aa198;">\;</span>
find . -name <span style="color: #2aa198;">"*.seq"</span>  -maxdepth <span style="color: #6c71c4;">1</span> -exec mv <span style="color: #2aa198;">{}</span> ./seq/ <span style="color: #2aa198;">\;</span>
find . -name <span style="color: #2aa198;">"*.csv"</span>  -maxdepth <span style="color: #6c71c4;">1</span> -exec mv <span style="color: #2aa198;">{}</span> ../csv/ <span style="color: #2aa198;">\;</span>

<span style="color: #839496; font-weight: bold;">cd</span> ../sw

mkdir fasta spectro seq

find . -name <span style="color: #2aa198;">"*.fas"</span>  -maxdepth <span style="color: #6c71c4;">1</span> -exec mv <span style="color: #2aa198;">{}</span> ./fasta/ <span style="color: #2aa198;">\;</span>
find . -name <span style="color: #2aa198;">"*.ab1"</span>  -maxdepth <span style="color: #6c71c4;">1</span> -exec mv <span style="color: #2aa198;">{}</span> ./spectro/ <span style="color: #2aa198;">\;</span>
find . -name <span style="color: #2aa198;">"*.seq"</span>  -maxdepth <span style="color: #6c71c4;">1</span> -exec mv <span style="color: #2aa198;">{}</span> ./seq/ <span style="color: #2aa198;">\;</span>
find . -name <span style="color: #2aa198;">"*.csv"</span>  -maxdepth <span style="color: #6c71c4;">1</span> -exec mv <span style="color: #2aa198;">{}</span> ../csv/ <span style="color: #2aa198;">\;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Contrôle qualité</h2>
<div class="outline-text-2" id="text-2">
<p>
Après avoir reçu les séquences, j'ai voulu connaître la qualité
globale des séquences. Je les ai donc converties en fastq avec le
script <a href="./src/ab1_to_fastq.sh">./src/ab1_to_fastq.sh</a>, et j'ai utilisé <code>fastqc</code> pour
représenter la qualité globale via le script <a href="./src/quality_control.sh">./src/quality_control.sh</a>.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #586e75;">#</span><span style="color: #586e75;">!/bin/</span><span style="color: #859900; font-weight: bold;">bash</span>

<span style="color: #586e75;"># </span><span style="color: #586e75;">transforme en fastq</span>
<span style="color: #839496; font-weight: bold;">cd</span> data/ws

touch ws_untrimmed.fastq

<span style="color: #859900; font-weight: bold;">for</span> file<span style="color: #859900; font-weight: bold;"> in</span> spectro/*.ab1
<span style="color: #859900; font-weight: bold;">do</span>
    seqret <span style="color: #b58900; font-weight: bold;">\</span>
        -sformat abi <span style="color: #b58900; font-weight: bold;">\</span>
        -osformat fastq <span style="color: #b58900; font-weight: bold;">\</span>
        -auto <span style="color: #b58900; font-weight: bold;">\</span>
        -stdout <span style="color: #b58900; font-weight: bold;">\</span>
        -sequence $<span style="color: #268bd2;">file</span> <span style="color: #b58900; font-weight: bold;">\</span>
        &gt;&gt; ws_untrimmed.fastq
<span style="color: #859900; font-weight: bold;">done</span>

<span style="color: #839496; font-weight: bold;">cd</span> ../sw

<span style="color: #586e75;"># </span><span style="color: #586e75;">TEMPORAIRE, &#233;limine le fichier .ab1 tendancieux pour l'instant</span>
<span style="color: #586e75;"># </span><span style="color: #586e75;">rm spectro/psw76-1073bis.ab1</span>

touch sw_untrimmed.fastq

<span style="color: #859900; font-weight: bold;">for</span> file<span style="color: #859900; font-weight: bold;"> in</span> spectro/*.ab1
<span style="color: #859900; font-weight: bold;">do</span>
    seqret <span style="color: #b58900; font-weight: bold;">\</span>
        -sformat abi <span style="color: #b58900; font-weight: bold;">\</span>
        -osformat fastq <span style="color: #b58900; font-weight: bold;">\</span>
        -auto <span style="color: #b58900; font-weight: bold;">\</span>
        -stdout <span style="color: #b58900; font-weight: bold;">\</span>
        -sequence $<span style="color: #268bd2;">file</span> <span style="color: #b58900; font-weight: bold;">\</span>
        &gt;&gt; sw_untrimmed.fastq
<span style="color: #859900; font-weight: bold;">done</span>
</pre>
</div>

<p>
J'ai utilisé <code>fastqc</code> pour représenter la qualité globale via le
script <a href="./src/quality_control.sh">./src/quality_control.sh</a>.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #586e75;">#</span><span style="color: #586e75;">!/bin/</span><span style="color: #859900; font-weight: bold;">bash</span>

<span style="color: #586e75;"># </span><span style="color: #586e75;">contr&#244;le qualit&#233; des s&#233;quences.</span>
<span style="color: #839496; font-weight: bold;">cd</span> data

<span style="color: #586e75;"># </span><span style="color: #586e75;">cr&#233;e un dossier qc de quality control pour ws et sw</span>
mkdir -p qc/<span style="color: #2aa198;">{</span>ws,sw<span style="color: #2aa198;">}</span>

<span style="color: #586e75;"># </span><span style="color: #586e75;">fastqc sortie dasn le dossier appropri&#233;</span>
fastqc ws/ws_untrimmed.fastq -o qc/ws
fastqc sw/sw_untrimmed.fastq -o qc/sw

<span style="color: #586e75;"># </span><span style="color: #586e75;">transfert du fichier .png qui nous int&#233;resse dans le dir adapt&#233;</span>
<span style="color: #586e75;"># </span><span style="color: #586e75;">et suppression des dossiers inutiles</span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">' -qq : very quiet</span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">' -o  : overwrite without warning</span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">' -d  : out dir</span>
unzip -qq -o <span style="color: #b58900; font-weight: bold;">\</span>
      qc/sw/sw_untrimmed_fastqc.zip <span style="color: #b58900; font-weight: bold;">\</span>
      sw_untrimmed_fastqc/Images/per_base_quality.png <span style="color: #b58900; font-weight: bold;">\</span>
      -d ../anl/ <span style="color: #b58900; font-weight: bold;">\</span>
    &amp;&amp; mv ../anl/sw_untrimmed_fastqc/Images/per_base_quality.png <span style="color: #b58900; font-weight: bold;">\</span>
          ../anl/sw_per_base_qual.png <span style="color: #b58900; font-weight: bold;">\</span>
    &amp;&amp; rm -r ../anl/sw_untrimmed_fastqc

<span style="color: #586e75;"># </span><span style="color: #586e75;">transfert du fichier .png qui nous int&#233;resse dans le dir adapt&#233;</span>
<span style="color: #586e75;"># </span><span style="color: #586e75;">et suppression des dossiers inutiles</span>
unzip -qq -o <span style="color: #b58900; font-weight: bold;">\</span>
      qc/ws/ws_untrimmed_fastqc.zip <span style="color: #b58900; font-weight: bold;">\</span>
      ws_untrimmed_fastqc/Images/per_base_quality.png <span style="color: #b58900; font-weight: bold;">\</span>
      -d ../anl/ <span style="color: #b58900; font-weight: bold;">\</span>
    &amp;&amp; mv ../anl/ws_untrimmed_fastqc/Images/per_base_quality.png <span style="color: #b58900; font-weight: bold;">\</span>
          ../anl/ws_per_base_qual.png <span style="color: #b58900; font-weight: bold;">\</span>
    &amp;&amp; rm -r ../anl/ws_untrimmed_fastqc
</pre>
</div>

<p>
À priori les séquences sont plutôt de bonne qualité. Voir le résumé
dans le fichier <a href="./data/qc/sw/sw_untrimmed_fastqc.html">./data/qc/sw/sw_untrimmed_fastqc.html</a> et
<a href="./data/qc/ws/ws_untrimmed_fastqc.html">./data/qc/ws/ws_untrimmed_fastqc.html</a>.
</p>
</div>
</div>
