README.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Analyse rapide du SNP calling de GATC</h2>
<div class="outline-text-2" id="text-3">
<p>
J'ai rapidement analysé la sortie du SNP calling effectué par GATC,
mais il manque des données. Je vais refaire le SNP calling moi-même,
en utilisant dans un premier temps ssaha2.
</p>

<p>
Le script est là <a href="./anl/gatc_snpcall/snp_call.r">./anl/gatc_snpcall/snp_call.r</a>, les sorties en
html là <a href="./anl/gatc_snpcall/snp_call.html">./anl/gatc_snpcall/snp_call.html</a>.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> SNP calling global</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> trimming des séquences</h3>
<div class="outline-text-3" id="text-4-1">
<p>
J'ai utilisé le programme bbduk pour trimmer les séquences de faible
qualité.
</p>

<div class="org-src-container">

<pre class="src src-sh">  <span style="color: #586e75;">#</span><span style="color: #586e75;">!/bin/bash</span>

  <span style="color: #586e75;">#</span><span style="color: #586e75;">' -qtrim=rl : quality trim right and left</span>
  <span style="color: #586e75;">#</span><span style="color: #586e75;">' -trimq=28 : trim if quality &lt; 28 (sanger encoding, illumina 1.9)</span>
  <span style="color: #586e75;">#</span><span style="color: #586e75;">' -minlen=620 : keep only seq with length &gt; 620, after trimming.</span>
  <span style="color: #586e75;">#</span><span style="color: #586e75;">' -Xmx1g : tells bbduk / java to use 1G of RAM</span>

  <span style="color: #268bd2;">FASTQ</span>=<span style="color: #2aa198;">"data/sw/sw_untrimmed.fastq</span>
<span style="color: #2aa198;">  data/ws/ws_untrimmed.fastq</span>
<span style="color: #2aa198;">  "</span>

  <span style="color: #859900; font-weight: bold;">for</span> f<span style="color: #859900; font-weight: bold;"> in</span> $<span style="color: #268bd2;">FASTQ</span>
  <span style="color: #859900; font-weight: bold;">do</span>
      <span style="color: #268bd2;">out</span>=$<span style="color: #268bd2;">f</span>.trim
      bin/bbmap/bbduk.sh -Xmx1g <span style="color: #b58900; font-weight: bold;">\</span>
                         -in=$<span style="color: #268bd2;">f</span> <span style="color: #b58900; font-weight: bold;">\</span>
                         -out=$<span style="color: #268bd2;">f</span>.qtrim <span style="color: #b58900; font-weight: bold;">\</span>
                         -qtrim=rl <span style="color: #b58900; font-weight: bold;">\</span>
                         -trimq=<span style="color: #6c71c4;">28</span> <span style="color: #b58900; font-weight: bold;">\</span>
                         -minlen=<span style="color: #6c71c4;">600</span>

      <span style="color: #586e75;">## </span><span style="color: #586e75;">convertit les bases d'une qualit&#233; inf&#233;rieure &#224; 20 en N.</span>
      seqtk seq <span style="color: #b58900; font-weight: bold;">\</span>
            -q20 <span style="color: #b58900; font-weight: bold;">\</span>
            -nN <span style="color: #b58900; font-weight: bold;">\</span>
            $<span style="color: #268bd2;">f</span>.qtrim &gt; $<span style="color: #268bd2;">out</span>

      <span style="color: #586e75;">## </span><span style="color: #586e75;">convertit le fastq en fasta</span>
      seqret <span style="color: #b58900; font-weight: bold;">\</span>
          -sformat fastq <span style="color: #b58900; font-weight: bold;">\</span>
          -osformat fasta <span style="color: #b58900; font-weight: bold;">\</span>
          -auto -stdout <span style="color: #b58900; font-weight: bold;">\</span>
          -sequence $<span style="color: #268bd2;">out</span> &gt; $<span style="color: #268bd2;">f</span>.fasta

      rm $<span style="color: #268bd2;">f</span>.qtrim
  <span style="color: #859900; font-weight: bold;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Contrôle qualité des séquences trimmées</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">

<pre class="src src-sh">  <span style="color: #586e75;">#</span><span style="color: #586e75;">!/usr/bin/env bash</span>

  <span style="color: #839496; font-weight: bold;">cd</span> data

  <span style="color: #268bd2;">TRIM</span>=<span style="color: #2aa198;">"ws/ws_untrimmed.fastq.trim sw/sw_untrimmed.fastq.trim"</span>

  mkdir qtrim_qc

  <span style="color: #859900; font-weight: bold;">for</span> f<span style="color: #859900; font-weight: bold;"> in</span> $<span style="color: #268bd2;">TRIM</span>
  <span style="color: #859900; font-weight: bold;">do</span>
      fastqc $<span style="color: #268bd2;">f</span> -o qtrim_qc
  <span style="color: #859900; font-weight: bold;">done</span>
</pre>
</div>

<p>
Le script est là <a href="./src/qtrim_qc.sh">./src/qtrim_qc.sh</a> et les sorties sont là
<a href="data/qtrim_qc/sw_untrimmed.fastq.trim_fastqc.html">./data/qtrim<sub>qc</sub>/sw<sub>untrimmed.fastq.trim</sub><sub>fastqc.html</sub></a> et là
<a href="data/qtrim_qc/sw_untrimmed.fastq.trim_fastqc.html">./data/qtrim<sub>qc</sub>/ws<sub>untrimmed.fastq.trim</sub><sub>fastqc.html</sub></a>.
</p>

<p>
Les séquences sont nettement raccourcies par rapport aux séquences non trimmées. Mais l'ensemble des
bases qu'on veut analyser sont de bonne qualité. C'est donc plutôt bon signe.
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Pooling des séquences dans un seul fastq</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-sh">  <span style="color: #586e75;">#</span><span style="color: #586e75;">!/usr/bin/env bash</span>

  cat data/sw/sw_untrimmed.fastq.trim data/ws/ws_untrimmed.fastq.trim &gt; data/trimmed.fastq
</pre>
</div>

<p>
<a href="./src/pool_trim.sh">./src/pool_trim.sh</a>
</p>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Analyses des alignements via seaview</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Pour les analyses dans seaview, il faut un fichier fasta. Je lui
ajoute la référence.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #586e75;">#</span><span style="color: #586e75;">!/usr/bin/</span><span style="color: #859900; font-weight: bold;">env</span><span style="color: #586e75;"> bash</span>

seqret -sformat fastq -osformat fasta -auto -stdout <span style="color: #b58900; font-weight: bold;">\</span>
       -sequence data/trimmed.fastq &gt; data/trimmed.fasta

fastx_reverse_complement <span style="color: #b58900; font-weight: bold;">\</span>
    -i raw/ref/reference1073bis-1392.fasta <span style="color: #b58900; font-weight: bold;">\</span>
    &gt;&gt; data/trimmed.fasta
</pre>
</div>

<p>
<a href="./src/trim_to_fasta.sh">./src/trim_to_fasta.sh</a>
</p>

<p>
J'ai placé les différentes analyses graphiques via seaview dans le
dossier <a href="./anl/align">./anl/align</a>.
</p>

<p>
Différents alignements :
</p>
<ul class="org-ul">
<li>l'alignement global : <a href="./anl/align/trimmed.mase">./anl/align/trimmed.mase</a>
</li>
<li>l'alignement avec seulement les sites variables : <a href="./anl/align/variable_site.mase">./anl/align/variable_site.mase</a>
</li>
</ul>

<p>
Sur l'alignement global, j'ai repéré quelques cas de traces complexes,
où des séquences avaient ‘gardé’ leur allèle sauvage, quand les deux
SNP environnants sont les SNP transformants.
</p>
</div>
</div>
