README.html

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> snp calling via ssahaSNP</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Pour installer ssahaSNP voir les instructions là :
<a href="ftp://ftp.sanger.ac.uk/pub/resources/software/ssahasnp/">ftp://ftp.sanger.ac.uk/pub/resources/software/ssahasnp/</a>.
</p>

<p>
Il est très important que les fichiers fasta de référence soit formattés de la
bonne façon, sinon ssahaSNP ne sort pas les bonnes valeurs dans les lignes de
tableau.
</p>

<div class="org-src-container">

<pre class="src src-sh">   <span style="color: #586e75;">#</span><span style="color: #586e75;">!/usr/bin/env bash</span>

   <span style="color: #586e75;"># </span><span style="color: #586e75;">Variant calling using ssaha2 and ssahaSNP</span>

   <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #2aa198;">[</span> <span style="color: #b58900; font-weight: bold;">!</span> -e data/snp_call <span style="color: #2aa198;">]</span>
   <span style="color: #859900; font-weight: bold;">then</span>
       mkdir data/snp_call
   <span style="color: #859900; font-weight: bold;">fi</span>

   <span style="color: #839496; font-weight: bold;">cd</span> data/snp_call

   <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #2aa198;">[</span><span style="color: #b58900;">[</span> <span style="color: #b58900; font-weight: bold;">!</span> -e trimmed.fastq &amp;&amp; <span style="color: #b58900; font-weight: bold;">!</span> -e ref.fasta <span style="color: #b58900;">]</span><span style="color: #2aa198;">]</span>
   <span style="color: #859900; font-weight: bold;">then</span>
       ln -s    ../trimmed.fastq .
       ln -s ../../raw/ref/reference1073bis-1392.fasta ref.fasta
   <span style="color: #859900; font-weight: bold;">fi</span>

   <span style="color: #586e75;">## </span><span style="color: #586e75;">alignement &#224; la s&#233;quence de r&#233;f&#233;rence</span>
   <span style="color: #586e75;">#</span><span style="color: #586e75;">' -output psl :             format de sortie psl</span>
   <span style="color: #586e75;">#</span><span style="color: #586e75;">' reference_reverse.fasta : s&#233;quence de r&#233;f&#233;rence</span>
   <span style="color: #586e75;">#</span><span style="color: #586e75;">' trimmed.fastq :           s&#233;quence &#224; aligner</span>
   <span style="color: #586e75;">#</span><span style="color: #586e75;">' output.psl :              fichier de sortie</span>
   ../../bin/ssahaSNP/ssaha2 -output psl ref.fasta trimmed.fastq &gt; output.psl

   <span style="color: #586e75;">## </span><span style="color: #586e75;">column annotation based on</span>
   <span style="color: #586e75;">## </span><span style="color: #586e75;">ftp://ftp.sanger.ac.uk/pub/resources/software/ssahasnp/readme,</span>
   <span style="color: #586e75;">## </span><span style="color: #586e75;">part (6) some further information</span>
   <span style="color: #586e75;"># </span><span style="color: #586e75;">la premi&#232;re ligne du fichier .dat, afin d'&#234;tre lu dans R</span>
   cat <span style="color: #b58900; font-weight: bold;">\</span>
       &lt;<span style="color: #2aa198;">(</span> <span style="color: #839496; font-weight: bold;">echo</span> <span style="color: #2aa198;">"match subject_name index_of_subject read_name s_base q_base s_qual q_qual offset_on_subject offset_on_read length_of_snp start_match_of_read end_match_of_read match_direction length_of_subject"</span> <span style="color: #2aa198;">)</span> <span style="color: #b58900; font-weight: bold;">\</span>
       &lt;<span style="color: #2aa198;">(</span> ../../bin/ssahaSNP/ssahaSNP ref.fasta trimmed.fastq | <span style="color: #b58900; font-weight: bold;">\</span>
                egrep ssaha:SNP | <span style="color: #b58900; font-weight: bold;">\</span>
                awk <span style="color: #2aa198;">'{print $1,$2,$3,$4,$5,$6,$7,$8,$9,$10,$11,$12,$13,$14,$15}'</span><span style="color: #2aa198;">)</span> <span style="color: #b58900; font-weight: bold;">\</span>
       &gt; snp_calling.dat
</pre>
</div>

<p>
Le script est là : <a href="./src/snp_call.sh">./src/snp_call.sh</a>.
</p>
</div>
</div>

<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> création de la table d'identification des clones</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Les spectrogrammes contiennent l'info permettant de relier à un
identifiant de séquence le nom expérimental qu'on lui a attribué.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="background-color: #073642;"> </span> <span style="color: #586e75;">#</span><span style="color: #586e75;">!/usr/bin/env python</span>

<span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">from</span> Bio <span style="color: #859900; font-weight: bold;">import</span> SeqIO
<span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">from</span> glob <span style="color: #859900; font-weight: bold;">import</span> glob
<span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">from</span> os.path <span style="color: #859900; font-weight: bold;">import</span> basename

<span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">sw_or_ws</span><span style="color: #2aa198;">(</span>mutant_name<span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #2aa198;">"""</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;"> Determine si le mutant est SW ou WS</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;"> """</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #2aa198;">'sw'</span> <span style="color: #859900; font-weight: bold;">in</span> mutant_name:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #2aa198;">'sw'</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">else</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #2aa198;">'ws'</span>

<span style="background-color: #073642;"> </span> <span style="color: #586e75;"># </span><span style="color: #586e75;">en tete de colonne</span>
<span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">print</span> <span style="color: #2aa198;">"id name mutant"</span>

<span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">print_seq_id</span><span style="color: #2aa198;">(</span>dna_seq<span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">with</span> <span style="color: #839496; font-weight: bold;">open</span><span style="color: #2aa198;">(</span>dna_seq, <span style="color: #2aa198;">"rb"</span><span style="color: #2aa198;">)</span> <span style="color: #859900; font-weight: bold;">as</span> spectro:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #268bd2;">sequence</span> = <span style="color: #839496; font-weight: bold;">list</span><span style="color: #2aa198;">(</span>SeqIO.parse<span style="color: #b58900;">(</span>spectro, <span style="color: #2aa198;">"abi"</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">print</span> sequence<span style="color: #2aa198;">[</span><span style="color: #6c71c4;">0</span><span style="color: #2aa198;">]</span>.<span style="color: #839496; font-weight: bold;">id</span> + <span style="color: #2aa198;">" "</span> + sequence<span style="color: #2aa198;">[</span><span style="color: #6c71c4;">0</span><span style="color: #2aa198;">]</span>.name + <span style="color: #2aa198;">" "</span> + sw_or_ws<span style="color: #2aa198;">(</span>sequence<span style="color: #b58900;">[</span><span style="color: #6c71c4;">0</span><span style="color: #b58900;">]</span>.name<span style="color: #2aa198;">)</span>

<span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #839496; font-weight: bold;">file</span> <span style="color: #859900; font-weight: bold;">in</span> glob<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"data/sw/spectro/*.ab1"</span><span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">if</span> basename<span style="color: #2aa198;">(</span><span style="color: #839496; font-weight: bold;">file</span><span style="color: #2aa198;">)</span> != <span style="color: #2aa198;">"psw76-1073bis.ab1"</span>: <span style="color: #586e75;"># </span><span style="color: #586e75;">exclut la sequence qui pose probleme</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> print_seq_id<span style="color: #2aa198;">(</span><span style="color: #839496; font-weight: bold;">file</span><span style="color: #2aa198;">)</span>

<span style="background-color: #073642;"> </span> <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #839496; font-weight: bold;">file</span> <span style="color: #859900; font-weight: bold;">in</span> glob<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"data/ws/spectro/*.ab1"</span><span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> print_seq_id<span style="color: #2aa198;">(</span><span style="color: #839496; font-weight: bold;">file</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
