README.html
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> phred + muscle = phruscle !</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Le SNP calling via ssahaSNP ne permet pas de connaître l'ensemble des
informations dont on a besoin. Un peu dans l'esprit de polySNP, je
veux écrire un script python qui permette :
</p>

<ol class="org-ol">
<li>de lancer phred sur la séquence abi en entrée.
</li>
<li>de lancer muscle avec pour entrée le fichier d'alignement fst entre
le gène synthétique et la séquence sauvage d'une part, et la
séquence dans le fichier seq d'autre part.
</li>
<li>d'analyser la sortie de phred .phd pour extraire l'information de
la qualité de la base.
</li>
</ol>

<p>
Étant donné le nombre de séquence faible, j'ai fait le choix de lancer
muscle à chaque séquence. Une façon plus efficace de faire la même
chose serait d'aligner l'ensemble des séquences SNP WS d'un coup, avec
leur référence, mais c'est un peu plus compliqué à programmer.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #586e75;"># </span><span style="color: #586e75;">-*- coding: utf-8 -*-</span>

<span style="color: #586e75;"># </span><span style="color: #586e75;">1. lancer phred sur la s&#233;quence abi en entr&#233;e.</span>
<span style="color: #586e75;"># </span><span style="color: #586e75;">2. lancer muscle avec pour entr&#233;e le fichier d'alignement fst entre</span>
<span style="color: #586e75;">#    </span><span style="color: #586e75;">le g&#232;ne synth&#233;tique et la s&#233;quence sauvage d'une part, et la</span>
<span style="color: #586e75;">#    </span><span style="color: #586e75;">s&#233;quence dans le fichier seq d'autre part.</span>
<span style="color: #586e75;"># </span><span style="color: #586e75;">3. analyser la sortie de phred .phd pour extraire l'information de</span>
<span style="color: #586e75;">#    </span><span style="color: #586e75;">la qualit&#233; de la base.</span>

<span style="color: #859900; font-weight: bold;">import</span> os.path
<span style="color: #859900; font-weight: bold;">import</span> io
<span style="color: #859900; font-weight: bold;">import</span> subprocess <span style="color: #859900; font-weight: bold;">as</span> sub  <span style="color: #586e75;"># </span><span style="color: #586e75;">permet de lancer phred et muscle</span>
<span style="color: #859900; font-weight: bold;">import</span> click  <span style="color: #586e75;"># </span><span style="color: #586e75;">construit la cli</span>
<span style="color: #859900; font-weight: bold;">from</span> Bio <span style="color: #859900; font-weight: bold;">import</span> AlignIO  <span style="color: #586e75;"># </span><span style="color: #586e75;">permet d'analyser les sorties de muscle.</span>
<span style="color: #859900; font-weight: bold;">from</span> Bio <span style="color: #859900; font-weight: bold;">import</span> SeqIO  <span style="color: #586e75;"># </span><span style="color: #586e75;">permet de tester les entr&#233;es</span>
<span style="color: #859900; font-weight: bold;">from</span> Bio.Seq <span style="color: #859900; font-weight: bold;">import</span> Seq
<span style="color: #859900; font-weight: bold;">import</span> numpy <span style="color: #859900; font-weight: bold;">as</span> np
<span style="color: #859900; font-weight: bold;">import</span> pandas <span style="color: #859900; font-weight: bold;">as</span> pd

<span style="color: #586e75;"># </span><span style="color: #cc9393;">TODO</span><span style="color: #586e75;">: d&#233;finir les chemins de fichiers avec constance.</span>


<span style="color: #b58900;">@click.group</span><span style="color: #2aa198;">()</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">phruscle</span><span style="color: #2aa198;">()</span>:
<span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""This program gather a set of function to run phred on a abi file, to run muscle on the</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   called bases, and to give a nicely formatted output as csv.</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   """</span>
<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">pass</span>


<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">is_abi</span><span style="color: #2aa198;">(</span>sequence<span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""Check if sequence if a spectrogram from abi file.</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param sequence: sequence file name. str.</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   """</span>
<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> os.path.splitext<span style="color: #2aa198;">(</span>sequence<span style="color: #2aa198;">)[</span><span style="color: #6c71c4;">1</span><span style="color: #2aa198;">]</span>.lower<span style="color: #2aa198;">()</span>.endswith<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span><span style="color: #2aa198;">'abi'</span>, <span style="color: #2aa198;">'ab1'</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #268bd2; font-weight: bold;">True</span>
<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">else</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #268bd2; font-weight: bold;">False</span>


<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">is_fasta</span><span style="color: #2aa198;">(</span>sequence<span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""Check if sequence is a fasta file.</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param sequence: name of the fasta file. str</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   """</span>
<span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">ext</span> = os.path.splitext<span style="color: #2aa198;">(</span>sequence<span style="color: #2aa198;">)[</span><span style="color: #6c71c4;">1</span><span style="color: #2aa198;">]</span>.lower<span style="color: #2aa198;">()</span>
<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> ext.endswith<span style="color: #2aa198;">(</span><span style="color: #b58900;">(</span><span style="color: #2aa198;">'.seq'</span>, <span style="color: #2aa198;">'.fasta'</span>, <span style="color: #2aa198;">'.aln'</span>, <span style="color: #2aa198;">'.fst'</span>, <span style="color: #2aa198;">'.rev'</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #268bd2; font-weight: bold;">True</span>
<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">else</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #268bd2; font-weight: bold;">False</span>

<span style="color: #586e75;">##</span><span style="color: #586e75;">-----------------------------------------------------------------------------</span>
<span style="color: #586e75;">##                                          </span><span style="color: #586e75;">BASECALL</span>
<span style="color: #586e75;">##</span><span style="color: #586e75;">-----------------------------------------------------------------------------</span>


<span style="color: #b58900;">@phruscle.command</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">'basecall'</span>, short_help=<span style="color: #2aa198;">'Make basecall and alignment.'</span><span style="color: #2aa198;">)</span>
<span style="color: #b58900;">@click.option</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">'-i'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #2aa198;">'--input'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #839496; font-weight: bold;">type</span>=click.File<span style="color: #b58900;">(</span><span style="color: #2aa198;">'rb'</span><span style="color: #b58900;">)</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> default=<span style="color: #2aa198;">'-'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #839496; font-weight: bold;">help</span>=<span style="color: #2aa198;">"The abi sequence to base call with phred"</span><span style="color: #2aa198;">)</span>
<span style="color: #b58900;">@click.option</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">'-r'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #2aa198;">'--ref'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #839496; font-weight: bold;">type</span>=click.File<span style="color: #b58900;">(</span><span style="color: #2aa198;">'r'</span><span style="color: #b58900;">)</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> default=<span style="color: #2aa198;">'-'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #839496; font-weight: bold;">help</span>=<span style="color: #2aa198;">"The reference alignment in fasta format"</span><span style="color: #2aa198;">)</span>
<span style="color: #b58900;">@click.option</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">'-c'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #2aa198;">'--cutoff'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> default=<span style="color: #6c71c4;">0</span>.<span style="color: #6c71c4;">05</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #839496; font-weight: bold;">help</span>=<span style="color: #2aa198;">"Probability of error of basecalling"</span><span style="color: #2aa198;">)</span>
<span style="color: #b58900;">@click.option</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">'--reverse'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> is_flag=<span style="color: #268bd2; font-weight: bold;">True</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #839496; font-weight: bold;">help</span>=<span style="color: #2aa198;">"Reverse complement sequencing file."</span><span style="color: #2aa198;">)</span>
<span style="color: #b58900;">@click.option</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">'--clustalw'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> is_flag=<span style="color: #268bd2; font-weight: bold;">True</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #839496; font-weight: bold;">help</span>=<span style="color: #2aa198;">"Muscle output in human readable clustalw format"</span><span style="color: #2aa198;">)</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">run_phruscle</span><span style="color: #2aa198;">(</span><span style="color: #839496; font-weight: bold;">input</span>, ref, cutoff, reverse, clustalw<span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""This programme uses phred to call bases on the `--input` file to create a fasta file.</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   Muscle align this fasta file to the `--ref`, without disrupting the reference,</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   to get the localisation of SNPs and their polarity.</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param input: the abi file to run phred on. str</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param ref: the reference alignment. str</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param cutoff: the maximum phred probability of error.</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param reverse: bool. compute reverse complement of input.</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param clustalw: bool. muscle output as human readable format clustalw.</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   """</span>

<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">run_phred</span><span style="color: #2aa198;">(</span>abi_file, cutoff<span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""Run phred on the abi_file, with a probability of base calling error of cutoff.</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param abi_file: the sanger sequencing file to base call. str</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param cutoff: probability of error. float.</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   """</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">print abi_file.name</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">assert</span> is_abi<span style="color: #2aa198;">(</span>abi_file.name<span style="color: #2aa198;">)</span>, <span style="color: #2aa198;">"Abi_File is not, well&#8230;, an abi file."</span>

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">phred reads and process file listed in the file abi_file via `-if`.</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">we must then create a temporary file containing only the name of the abi_file.</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">with</span> <span style="color: #839496; font-weight: bold;">open</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">'tempfile'</span>, <span style="color: #2aa198;">'w'</span><span style="color: #2aa198;">)</span> <span style="color: #859900; font-weight: bold;">as</span> tempfile:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   tempfile.write<span style="color: #2aa198;">(</span>abi_file.name + <span style="color: #2aa198;">"\n"</span><span style="color: #2aa198;">)</span>

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">subprocess.call takes a list of argument as abi_file.</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">the following list describes the phred list of argument.</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">phred</span> = <span style="color: #2aa198;">[</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"phred"</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-st"</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"fasta"</span>,  <span style="color: #586e75;"># </span><span style="color: #586e75;">sequence type output (default = fasta)</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-trim_alt"</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"\"\""</span>,  <span style="color: #586e75;"># </span><span style="color: #586e75;">quality trim</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-trim_cutoff"</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #839496; font-weight: bold;">str</span><span style="color: #b58900;">(</span>cutoff<span style="color: #b58900;">)</span>,  <span style="color: #586e75;"># </span><span style="color: #586e75;">error probability of trimming</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-trim_fasta"</span>,  <span style="color: #586e75;"># </span><span style="color: #586e75;">trim sortie fasta.</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-trim_phd"</span>,  <span style="color: #586e75;"># </span><span style="color: #586e75;">trim sortie phd</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-s"</span>,  <span style="color: #586e75;"># </span><span style="color: #586e75;">write seq file, append ".seq" to the names of the abi_file files</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-d"</span>,  <span style="color: #586e75;"># </span><span style="color: #586e75;">write a poly file</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-p"</span>,  <span style="color: #586e75;"># </span><span style="color: #586e75;">write a phd file</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-if"</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"tempfile"</span>  <span style="color: #586e75;"># </span><span style="color: #586e75;">abi_file file</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">]</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">phred_call</span> = sub.call<span style="color: #2aa198;">(</span>phred<span style="color: #2aa198;">)</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   os.remove<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"tempfile"</span><span style="color: #2aa198;">)</span>  <span style="color: #586e75;"># </span><span style="color: #586e75;">supprime le fichier temporaire</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> phred_call

<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">run_muscle</span><span style="color: #2aa198;">(</span>phred_output, reference, clw=<span style="color: #268bd2; font-weight: bold;">False</span><span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""Run muscle on the phred_output sequence, and align it to the reference sequence.</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param phred_output: the fasta sequence to align.</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param reference: the reference fasta sequence.</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   """</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">assert</span> is_fasta<span style="color: #2aa198;">(</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   phred_output<span style="color: #2aa198;">)</span>, <span style="color: #2aa198;">"La s&#233;quence n'est pas un fichier fasta."</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">assert</span> is_fasta<span style="color: #2aa198;">(</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   reference.name<span style="color: #2aa198;">)</span>, <span style="color: #2aa198;">"La r&#233;f&#233;rence n'est pas un fichier fasta."</span>

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">muscle</span> = <span style="color: #2aa198;">[</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"muscle"</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-quiet"</span>,  <span style="color: #586e75;"># </span><span style="color: #586e75;">non verbose</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-profile"</span>,  <span style="color: #586e75;"># </span><span style="color: #586e75;">do not disrupt the profile alignment</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">"-clw",</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">"-objscore",</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">"ps",  # matrice de scoring</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">"-maxmb",</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">str(100),  # 100M as max memory</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-in1"</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   phred_output,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-in2"</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   reference.name,  <span style="color: #586e75;"># </span><span style="color: #586e75;">profile is reference</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"-out"</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   phred_output + <span style="color: #2aa198;">".aln"</span>  <span style="color: #586e75;"># </span><span style="color: #586e75;">append .aln to phred_output name</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">]</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> clw:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   muscle.append<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"-clw"</span><span style="color: #2aa198;">)</span>

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">muscle_call</span> = sub.call<span style="color: #2aa198;">(</span>muscle<span style="color: #2aa198;">)</span>  <span style="color: #586e75;"># </span><span style="color: #586e75;">call muscle list on input</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> muscle_call  <span style="color: #586e75;"># </span><span style="color: #586e75;">return 0 or 1 if muscle is successful.</span>

<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">reverse_complement</span><span style="color: #2aa198;">(</span>seq_in, seq_out<span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""Read seq_in and writes its reverse complement to seq_out.</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param seq_in: sequence to reverse comp. str</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param seq_out: sequence to write revcomp to. str</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :returns: None.</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :rtype: NoneType.</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   """</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">record</span> = SeqIO.read<span style="color: #2aa198;">(</span><span style="color: #839496; font-weight: bold;">open</span><span style="color: #b58900;">(</span>seq_in<span style="color: #b58900;">)</span>, <span style="color: #2aa198;">"fasta"</span><span style="color: #2aa198;">)</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   SeqIO.write<span style="color: #2aa198;">(</span>record.reverse_complement<span style="color: #b58900;">()</span>, <span style="color: #839496; font-weight: bold;">open</span><span style="color: #b58900;">(</span>seq_out, <span style="color: #2aa198;">'w'</span><span style="color: #b58900;">)</span>, <span style="color: #2aa198;">'fasta'</span><span style="color: #2aa198;">)</span>

<span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">phred_code</span> = run_phred<span style="color: #2aa198;">(</span><span style="color: #839496; font-weight: bold;">input</span>, cutoff<span style="color: #2aa198;">)</span>

<span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">phred_output</span> = os.path.basename<span style="color: #2aa198;">(</span><span style="color: #839496; font-weight: bold;">input</span>.name<span style="color: #2aa198;">)</span> + <span style="color: #2aa198;">".seq"</span>
<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> reverse:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   reverse_complement<span style="color: #2aa198;">(</span>phred_output, phred_output + <span style="color: #2aa198;">".rev"</span><span style="color: #2aa198;">)</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">phred_output</span> += <span style="color: #2aa198;">".rev"</span>

<span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">muscle_code</span> = run_muscle<span style="color: #2aa198;">(</span>phred_output, ref, clustalw<span style="color: #2aa198;">)</span>

<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> phred_code == <span style="color: #6c71c4;">0</span> <span style="color: #859900; font-weight: bold;">and</span> muscle_code == <span style="color: #6c71c4;">0</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">print</span> <span style="color: #2aa198;">"Phruscle ran fine."</span>
<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">elif</span> muscle_code != <span style="color: #6c71c4;">0</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">print</span> <span style="color: #2aa198;">"Muscle failed."</span>
<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">else</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">print</span> <span style="color: #2aa198;">"Phred failed."</span>

<span style="color: #586e75;">##</span><span style="color: #586e75;">-----------------------------------------------------------------------------</span>
<span style="color: #586e75;">## </span><span style="color: #586e75;">TABLE</span>
<span style="color: #586e75;">##</span><span style="color: #586e75;">-----------------------------------------------------------------------------</span>
<span style="color: #586e75;"># </span><span style="color: #586e75;">for line in reversed(open("filename").readlines()):</span>
<span style="color: #586e75;">#     </span><span style="color: #586e75;">print line.rstrip()</span>


<span style="color: #b58900;">@phruscle.command</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">'table'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> short_help=<span style="color: #2aa198;">"Make a table of SNP quality and polarity"</span><span style="color: #2aa198;">)</span>
<span style="color: #b58900;">@click.option</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">'-i'</span>, <span style="color: #2aa198;">'--input'</span>, <span style="color: #839496; font-weight: bold;">help</span>=<span style="color: #2aa198;">"Input alignment in fasta format."</span><span style="color: #2aa198;">)</span>
<span style="color: #b58900;">@click.option</span><span style="color: #2aa198;">(</span>
<span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'-p'</span>,
<span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'--phd'</span>,
<span style="background-color: #073642;"> </span>   <span style="color: #839496; font-weight: bold;">help</span>=<span style="color: #2aa198;">"Input sequence quality and position file, output by phred."</span><span style="color: #2aa198;">)</span>
<span style="color: #b58900;">@click.option</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">'-o'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #2aa198;">'--output'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #839496; font-weight: bold;">type</span>=click.File<span style="color: #b58900;">(</span><span style="color: #2aa198;">'wb'</span><span style="color: #b58900;">)</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> default=<span style="color: #2aa198;">'-'</span>, <span style="color: #586e75;"># </span><span style="color: #586e75;">default is print to stdin</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #839496; font-weight: bold;">help</span>=<span style="color: #2aa198;">"Output file in csv format. Default is STDOUT."</span><span style="color: #2aa198;">)</span>
<span style="color: #b58900;">@click.option</span><span style="color: #2aa198;">(</span>
<span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'-r'</span>,
<span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'--reverse'</span>,
<span style="background-color: #073642;"> </span>   is_flag=<span style="color: #268bd2; font-weight: bold;">True</span>,
<span style="background-color: #073642;"> </span>   <span style="color: #839496; font-weight: bold;">help</span>=
<span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"Reverse the phd file. Useful when reference and sequence are not in the same direction."</span>
<span style="color: #2aa198;">)</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">clean_output</span><span style="color: #2aa198;">(</span><span style="color: #839496; font-weight: bold;">input</span>, phd, output, reverse=<span style="color: #268bd2; font-weight: bold;">False</span><span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""This programme takes a fasta alignment between the experimental sequence and the</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   reference alignment, find the quality of the base call in the phd file, and outputs it</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   as csv.</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   \b</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   To read the consensus (cons) output:</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   - `.` : the three bases are the same.</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   - `x` : the sequenced base matches to the snp base.</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   - `X` : the sequenced base matches the WT base.</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   - `-` : the sequenced base is misaligned.</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   - `N` : the base was not called.</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   """</span>

<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">parse_muscle</span><span style="color: #2aa198;">(</span>align<span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""Cette fonction renvoit un dict comprenant 3 choses :</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   1. la s&#233;quence align&#233;e</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   2. la s&#233;quence sauvage</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   3. la s&#233;quence avec les SNP</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   """</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">assert</span> is_fasta<span style="color: #2aa198;">(</span>align<span style="color: #2aa198;">)</span>, <span style="color: #2aa198;">"Le fichier n'est pas un fichier fasta"</span>

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">read_seq</span><span style="color: #2aa198;">(</span>sequence, index<span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""quick wrapper around AlignIO.read()"""</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> AlignIO.read<span style="color: #2aa198;">(</span>sequence, <span style="color: #2aa198;">"fasta"</span><span style="color: #2aa198;">)[</span>index<span style="color: #2aa198;">]</span>

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #2aa198;">{</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'exp'</span>: <span style="color: #839496; font-weight: bold;">str</span><span style="color: #b58900;">(</span>read_seq<span style="color: #268bd2;">(</span>align, <span style="color: #6c71c4;">0</span><span style="color: #268bd2;">)</span>.seq<span style="color: #b58900;">)</span>,  <span style="color: #586e75;"># </span><span style="color: #586e75;">la s&#233;quence exp&#233;rimentale</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'wt'</span>: <span style="color: #839496; font-weight: bold;">str</span><span style="color: #b58900;">(</span>read_seq<span style="color: #268bd2;">(</span>align, <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span>.seq<span style="color: #b58900;">)</span>,  <span style="color: #586e75;"># </span><span style="color: #586e75;">la s&#233;quence de r&#233;f&#233;rence</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'snp'</span>: <span style="color: #839496; font-weight: bold;">str</span><span style="color: #b58900;">(</span>read_seq<span style="color: #268bd2;">(</span>align, <span style="color: #6c71c4;">2</span><span style="color: #268bd2;">)</span>.seq<span style="color: #b58900;">)</span>  <span style="color: #586e75;"># </span><span style="color: #586e75;">g&#232;ne synth&#233;tique</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">}</span>

<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">are_the_same</span><span style="color: #2aa198;">(</span>seq_list<span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""D&#233;termine si les trois bases sont identiques. Renvoit `.` quand les trois bases sont</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   identiques, `x` quand la base exp est la base `snp`, `X` quand la base exp est la base</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   wt, et '-' quand la base exp ne correspond &#224; aucune des possibilit&#233;s</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   """</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">exp</span>, <span style="color: #268bd2;">snp</span>, <span style="color: #268bd2;">wt</span> = seq_list

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> exp == <span style="color: #2aa198;">'-'</span>:  <span style="color: #586e75;"># </span><span style="color: #586e75;">si la base a &#233;t&#233; trimm&#233;e ou non align&#233;e</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #2aa198;">'-'</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">elif</span> exp == snp <span style="color: #859900; font-weight: bold;">and</span> snp == wt:  <span style="color: #586e75;"># </span><span style="color: #586e75;">si les trois bases sont identiques</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #2aa198;">'.'</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">elif</span> exp == snp <span style="color: #859900; font-weight: bold;">and</span> snp != wt:  <span style="color: #586e75;"># </span><span style="color: #586e75;">si la base correspond au SNP</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #2aa198;">'x'</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">elif</span> exp != snp <span style="color: #859900; font-weight: bold;">and</span> exp == wt:  <span style="color: #586e75;"># </span><span style="color: #586e75;">si la base correspond au WT</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #2aa198;">'X'</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">else</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #2aa198;">'N'</span>  <span style="color: #586e75;"># </span><span style="color: #586e75;">si c'est encore autre chose ?</span>

<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">index_seq</span><span style="color: #2aa198;">(</span>sequence<span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""D&#233;termine la position dans la s&#233;quence exp&#233;rimentale"""</span>

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">position</span> = <span style="color: #6c71c4;">0</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">position_list</span> = <span style="color: #2aa198;">[]</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">for</span> index, base <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #839496; font-weight: bold;">enumerate</span><span style="color: #2aa198;">(</span>sequence<span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> base != <span style="color: #2aa198;">'-'</span>: <span style="color: #268bd2;">position</span> += <span style="color: #6c71c4;">1</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   position_list.append<span style="color: #2aa198;">(</span><span style="color: #839496; font-weight: bold;">str</span><span style="color: #b58900;">(</span>position<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> position_list

<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">polarity_snp</span><span style="color: #2aa198;">(</span>parsed_aln<span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""Give back the polarity of the SNP. Expect an output of parse_muscle."""</span>

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">consensus</span> = <span style="color: #2aa198;">[]</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">for</span> i, base <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #839496; font-weight: bold;">enumerate</span><span style="color: #2aa198;">(</span>parsed_aln<span style="color: #b58900;">[</span><span style="color: #2aa198;">'exp'</span><span style="color: #b58900;">]</span><span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">exp</span> = parsed_aln<span style="color: #2aa198;">[</span><span style="color: #2aa198;">'exp'</span><span style="color: #2aa198;">][</span>i<span style="color: #2aa198;">]</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">snp</span> = parsed_aln<span style="color: #2aa198;">[</span><span style="color: #2aa198;">'snp'</span><span style="color: #2aa198;">][</span>i<span style="color: #2aa198;">]</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">wt</span> = parsed_aln<span style="color: #2aa198;">[</span><span style="color: #2aa198;">'wt'</span><span style="color: #2aa198;">][</span>i<span style="color: #2aa198;">]</span>

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">consensus</span> += are_the_same<span style="color: #2aa198;">(</span><span style="color: #b58900;">[</span>exp, snp, wt<span style="color: #b58900;">]</span><span style="color: #2aa198;">)</span>

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> consensus

<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">parse_phd</span><span style="color: #2aa198;">(</span>align, rev=<span style="color: #268bd2; font-weight: bold;">False</span><span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""Return a pandas DataFrame by parsing a phred output.</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   :param align: a phd output.</span>

<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   """</span>

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">get_phd_seq_only</span><span style="color: #2aa198;">(</span>phd_file, reverse=<span style="color: #268bd2; font-weight: bold;">False</span><span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">"""Return string from BEGIN_DNA to END_DNA. If reverse is True, give the</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   sequence in inverse order."""</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;">## </span><span style="color: #586e75;">inspir&#233; de</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;">## </span><span style="color: #586e75;">http://stackoverflow.com/questions/7559397/python-read-file-from-and-to-specific-lines-of-textq,</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;">## </span><span style="color: #586e75;">r&#233;ponse de EOL</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">block</span> = <span style="color: #2aa198;">""</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">found</span> = <span style="color: #268bd2; font-weight: bold;">False</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">with</span> <span style="color: #839496; font-weight: bold;">open</span><span style="color: #2aa198;">(</span>phd_file, <span style="color: #2aa198;">'r'</span><span style="color: #2aa198;">)</span> <span style="color: #859900; font-weight: bold;">as</span> in_data:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900; font-weight: bold;">not</span> reverse:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">for</span> line <span style="color: #859900; font-weight: bold;">in</span> in_data:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> found:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> line.strip<span style="color: #2aa198;">()</span> == <span style="color: #2aa198;">"END_DNA"</span>: <span style="color: #859900; font-weight: bold;">break</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">else</span>: <span style="color: #268bd2;">block</span> += line
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">else</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> line.strip<span style="color: #2aa198;">()</span> == <span style="color: #2aa198;">"BEGIN_DNA"</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">found</span> = <span style="color: #268bd2; font-weight: bold;">True</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">block</span> = <span style="color: #2aa198;">""</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">else</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">dans l'autre sens.</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">for</span> line <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #839496; font-weight: bold;">reversed</span><span style="color: #2aa198;">(</span>in_data.readlines<span style="color: #b58900;">()</span><span style="color: #2aa198;">)</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> found:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> line.strip<span style="color: #2aa198;">()</span> == <span style="color: #2aa198;">"BEGIN_DNA"</span>: <span style="color: #859900; font-weight: bold;">break</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">else</span>: <span style="color: #268bd2;">block</span> += line
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">else</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> line.strip<span style="color: #2aa198;">()</span> == <span style="color: #2aa198;">"END_DNA"</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">found</span> = <span style="color: #268bd2; font-weight: bold;">True</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">block</span> = <span style="color: #2aa198;">""</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> block

<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">pd.DataFrame.</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">return</span> pd.read_table<span style="color: #2aa198;">(</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   io.StringIO<span style="color: #b58900;">(</span>u<span style="color: #2aa198;">"%s"</span> % get_phd_seq_only<span style="color: #268bd2;">(</span>align,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>reverse=rev<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   sep=<span style="color: #2aa198;">" "</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   names=<span style="color: #b58900;">[</span><span style="color: #2aa198;">'base'</span>, <span style="color: #2aa198;">'qual'</span>, <span style="color: #2aa198;">'phase'</span><span style="color: #b58900;">]</span><span style="color: #2aa198;">)</span>  <span style="color: #586e75;"># </span><span style="color: #586e75;">'phase' = spectrogramme pos</span>

<span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">parsed_align</span> = parse_muscle<span style="color: #2aa198;">(</span><span style="color: #839496; font-weight: bold;">input</span><span style="color: #2aa198;">)</span>

<span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">clean_data</span> = pd.DataFrame<span style="color: #2aa198;">(</span><span style="color: #b58900;">{</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'seqp'</span>: index_seq<span style="color: #268bd2;">(</span>parsed_align<span style="color: #6c71c4;">[</span><span style="color: #2aa198;">'exp'</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'seqb'</span>: <span style="color: #839496; font-weight: bold;">list</span><span style="color: #268bd2;">(</span>parsed_align<span style="color: #6c71c4;">[</span><span style="color: #2aa198;">'exp'</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'refp'</span>: index_seq<span style="color: #268bd2;">(</span>parsed_align<span style="color: #6c71c4;">[</span><span style="color: #2aa198;">'wt'</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'refb'</span>: <span style="color: #839496; font-weight: bold;">list</span><span style="color: #268bd2;">(</span>parsed_align<span style="color: #6c71c4;">[</span><span style="color: #2aa198;">'wt'</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'snpb'</span>: <span style="color: #839496; font-weight: bold;">list</span><span style="color: #268bd2;">(</span>parsed_align<span style="color: #6c71c4;">[</span><span style="color: #2aa198;">'snp'</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'cons'</span>: polarity_snp<span style="color: #268bd2;">(</span>parsed_align<span style="color: #268bd2;">)</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'name'</span>: <span style="color: #839496; font-weight: bold;">input</span>
<span style="background-color: #073642;"> </span>   <span style="color: #b58900;">}</span><span style="color: #2aa198;">)</span>

<span style="background-color: #073642;"> </span>   <span style="color: #586e75;">## </span><span style="color: #586e75;">use pandas concat to concatenate two datasets along the axis 1, equivalent to cbind in R.</span>
<span style="background-color: #073642;"> </span>   <span style="color: #586e75;">## </span><span style="color: #586e75;">ignore_index indicate that the two dataframes are not combined with their index.</span>
<span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">with_phd</span> = pd.concat<span style="color: #2aa198;">(</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #b58900;">[</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   clean_data<span style="color: #268bd2;">[</span>clean_data.cons != <span style="color: #2aa198;">'-'</span><span style="color: #268bd2;">]</span>.reset_index<span style="color: #268bd2;">(</span>drop=<span style="color: #268bd2; font-weight: bold;">True</span><span style="color: #268bd2;">)</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">ne garde que les positions qui existent dans le phd file</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   parse_phd<span style="color: #268bd2;">(</span>phd,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> rev=reverse<span style="color: #268bd2;">)</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">parse the phred output. reverse it if necessary to align to the reference.</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #b58900;">]</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   axis=<span style="color: #6c71c4;">1</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   ignore_index=<span style="color: #268bd2; font-weight: bold;">True</span><span style="color: #2aa198;">)</span>
<span style="background-color: #073642;"> </span>   <span style="color: #586e75;"># </span><span style="color: #586e75;">change les noms de colonnes.</span>
<span style="background-color: #073642;"> </span>   <span style="color: #268bd2;">with_phd.columns</span> = <span style="color: #2aa198;">[</span><span style="color: #2aa198;">'cons'</span>, <span style="color: #2aa198;">'name'</span>, <span style="color: #2aa198;">'refb'</span>, <span style="color: #2aa198;">'refp'</span>, <span style="color: #2aa198;">'seqb'</span>, <span style="color: #2aa198;">'seqp'</span>, <span style="color: #2aa198;">'snpb'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="color: #2aa198;">'base'</span>, <span style="color: #2aa198;">'qual'</span>, <span style="color: #2aa198;">'phase'</span><span style="color: #2aa198;">]</span>

<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">if</span> output != <span style="color: #2aa198;">'-'</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   with_phd.to_csv<span style="color: #2aa198;">(</span>output, index=<span style="color: #268bd2; font-weight: bold;">False</span><span style="color: #2aa198;">)</span>
<span style="background-color: #073642;"> </span>   <span style="color: #859900; font-weight: bold;">else</span>:
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   click.echo<span style="color: #2aa198;">(</span>with_phd, <span style="color: #839496; font-weight: bold;">file</span>=output<span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
Le script suivant est un script pour déployer <code>phruscle</code>.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900; font-weight: bold;">from</span> setuptools <span style="color: #859900; font-weight: bold;">import</span> setup, find_packages

setup<span style="color: #2aa198;">(</span>name=<span style="color: #2aa198;">"phruscle"</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> version=<span style="color: #2aa198;">"0.0.1"</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> py_modules=<span style="color: #b58900;">[</span><span style="color: #2aa198;">"phruscle"</span><span style="color: #b58900;">]</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> packages=find_packages<span style="color: #b58900;">(</span><span style="color: #2aa198;">'src'</span><span style="color: #b58900;">)</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> package_dir=<span style="color: #b58900;">{</span><span style="color: #2aa198;">''</span>: <span style="color: #2aa198;">'src'</span><span style="color: #b58900;">}</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> install_requires=<span style="color: #b58900;">[</span>
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #2aa198;">'Click'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #2aa198;">'Biopython'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #2aa198;">'numpy'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #2aa198;">'pandas'</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> <span style="color: #b58900;">]</span>,
<span style="background-color: #073642;"> </span>   <span style="background-color: #073642;"> </span> entry_points=<span style="color: #2aa198;">'''</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   [console_scripts]</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   </span><span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   phruscle=phruscle:phruscle</span>
<span style="color: #2aa198; background-color: #073642;"> </span><span style="color: #2aa198;">   '''</span>, <span style="color: #2aa198;">)</span>
</pre>
</div>
<p>
Le script est là : <a href="./src/phruscle">./src/phruscle</a>.
</p>

<p>
Avec la commande suivante :
</p>
<div class="org-src-container">

<pre class="src src-sh">phruscle table -i pW85-1073.ab1 -o test.csv
</pre>
</div>

<p>
Je produit une table csv, que j'analyse rapidement dans R.
</p>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #268bd2; font-weight: bold;">library</span><span style="color: #2aa198; font-weight: bold;">(</span>dplyr<span style="color: #2aa198; font-weight: bold;">)</span>
<span style="color: #268bd2; font-weight: bold;">library</span><span style="color: #2aa198; font-weight: bold;">(</span>ggplot2<span style="color: #2aa198; font-weight: bold;">)</span>

<span style="color: #268bd2;">setwd</span><span style="color: #2aa198; font-weight: bold;">(</span><span style="color: #2aa198;">"./tmp"</span><span style="color: #2aa198; font-weight: bold;">)</span>
test <span style="color: #268bd2; font-weight: bold;">&lt;-</span> <span style="color: #268bd2;">read.csv</span><span style="color: #2aa198; font-weight: bold;">(</span><span style="color: #2aa198;">"test.csv"</span><span style="color: #2aa198; font-weight: bold;">)</span> <span style="color: #268bd2; font-weight: bold;">%&gt;%</span> <span style="color: #268bd2;">tbl_df</span><span style="color: #2aa198; font-weight: bold;">()</span>

test <span style="color: #268bd2; font-weight: bold;">%&gt;%</span>
  <span style="color: #268bd2;">qplot</span><span style="color: #2aa198; font-weight: bold;">(</span>data<span style="color: #268bd2; font-weight: bold;">=</span> ., x <span style="color: #268bd2; font-weight: bold;">=</span> refp, y <span style="color: #268bd2; font-weight: bold;">=</span> qual, geom <span style="color: #268bd2; font-weight: bold;">=</span> <span style="color: #268bd2;">c</span><span style="color: #b58900; font-weight: bold;">(</span><span style="color: #2aa198;">"point"</span>, <span style="color: #2aa198;">"line"</span><span style="color: #b58900; font-weight: bold;">)</span>, color <span style="color: #268bd2; font-weight: bold;">=</span> qual<span style="color: #2aa198; font-weight: bold;">)</span>
</pre>
</div>

<p>
À priori tout est bon. Le but est maintenant d'utiliser ce script sur un grand
nombre de séquence.
</p>
</div>
</div>
